zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u345xx.h
/**
  * @brief Improved Inter-integrated Circuit Interface
  */
typedef struct
{
  __IO uint32_t CR;             /*!< I3C Control register,                      Address offset: 0x00      */
  __IO uint32_t CFGR;           /*!< I3C Controller Configuration register,     Address offset: 0x04      */
  uint32_t      RESERVED1[2];   /*!< Reserved,                                  Address offset: 0x08-0x0C */
  __IO uint32_t RDR;            /*!< I3C Received Data register,                Address offset: 0x10      */
  __IO uint32_t RDWR;           /*!< I3C Received Data Word register,           Address offset: 0x14      */
  __IO uint32_t TDR;            /*!< I3C Transmit Data register,                Address offset: 0x18      */
  __IO uint32_t TDWR;           /*!< I3C Transmit Data Word register,           Address offset: 0x1C      */
  __IO uint32_t IBIDR;          /*!< I3C IBI payload Data register,             Address offset: 0x20      */
  __IO uint32_t TGTTDR;         /*!< I3C Target Transmit register,              Address offset: 0x24      */
  uint32_t      RESERVED2[2];   /*!< Reserved,                                  Address offset: 0x28-0x2C */
  __IO uint32_t SR;             /*!< I3C Status register,                       Address offset: 0x30      */
  __IO uint32_t SER;            /*!< I3C Status Error register,                 Address offset: 0x34      */
  uint32_t      RESERVED3[2];   /*!< Reserved,                                  Address offset: 0x38-0x3C */
  __IO uint32_t RMR;            /*!< I3C Received Message register,             Address offset: 0x40      */
  uint32_t      RESERVED4[3];   /*!< Reserved,                                  Address offset: 0x44-0x4C */
  __IO uint32_t EVR;            /*!< I3C Event register,                        Address offset: 0x50      */
  __IO uint32_t IER;            /*!< I3C Interrupt Enable register,             Address offset: 0x54      */
  __IO uint32_t CEVR;           /*!< I3C Clear Event register,                  Address offset: 0x58      */
  __IO uint32_t MISR;           /*!< I3C Masked Interrupt Status register,      Address offset: 0x5C      */
  __IO uint32_t DEVR0;          /*!< I3C own Target characteristics register,   Address offset: 0x60      */
  __IO uint32_t DEVRX[4];       /*!< I3C Target x (1<=x<=4) register,           Address offset: 0x64-0x70 */
  uint32_t      RESERVED6[7];   /*!< Reserved,                                  Address offset: 0x74-0x8C */
  __IO uint32_t MAXRLR;         /*!< I3C Maximum Read Length register,          Address offset: 0x90      */
  __IO uint32_t MAXWLR;         /*!< I3C Maximum Write Length register,         Address offset: 0x94      */
  uint32_t      RESERVED7[2];   /*!< Reserved,                                  Address offset: 0x98-0x9C */
  __IO uint32_t TIMINGR0;       /*!< I3C Timing 0 register,                     Address offset: 0xA0      */
  __IO uint32_t TIMINGR1;       /*!< I3C Timing 1 register,                     Address offset: 0xA4      */
  __IO uint32_t TIMINGR2;       /*!< I3C Timing 2 register,                     Address offset: 0xA8      */
  uint32_t      RESERVED9[5];   /*!< Reserved,                                  Address offset: 0xAC-0xBC */
  __IO uint32_t BCR;            /*!< I3C Bus Characteristics register,          Address offset: 0xC0      */
  __IO uint32_t DCR;            /*!< I3C Device Characteristics register,       Address offset: 0xC4      */
  __IO uint32_t GETCAPR;        /*!< I3C GET CAPabilities register,             Address offset: 0xC8      */
  __IO uint32_t CRCAPR;         /*!< I3C Controller CAPabilities register,      Address offset: 0xCC      */
  __IO uint32_t GETMXDSR;       /*!< I3C GET Max Data Speed register,           Address offset: 0xD0      */
  __IO uint32_t EPIDR;          /*!< I3C Extended Provisioned ID register,      Address offset: 0xD4      */
} I3C_TypeDef;

/**
  * @brief Instruction Cache
  */
typedef struct
{
  __IO uint32_t CR;               /*!< ICACHE control register,                Address offset: 0x00 */
  __IO uint32_t SR;               /*!< ICACHE status register,                 Address offset: 0x04 */
  __IO uint32_t IER;              /*!< ICACHE interrupt enable register,       Address offset: 0x08 */
  __IO uint32_t FCR;              /*!< ICACHE Flag clear register,             Address offset: 0x0C */
  __IO uint32_t HMONR;            /*!< ICACHE hit monitor register,            Address offset: 0x10 */
  __IO uint32_t MMONR;            /*!< ICACHE miss monitor register,           Address offset: 0x14 */
       uint32_t RESERVED1[2];     /*!< Reserved,                                        0x018-0x01C */
  __IO uint32_t CRR0;             /*!< ICACHE region 0 configuration register, Address offset: 0x20 */
  __IO uint32_t CRR1;             /*!< ICACHE region 1 configuration register, Address offset: 0x24 */
  __IO uint32_t CRR2;             /*!< ICACHE region 2 configuration register, Address offset: 0x28 */
  __IO uint32_t CRR3;             /*!< ICACHE region 3 configuration register, Address offset: 0x2C */
} ICACHE_TypeDef;

/**
  * @brief IWDG
  */
typedef struct
{
  __IO uint32_t KR;               /*!< IWDG Key register,          Address offset: 0x00 */
  __IO uint32_t PR;               /*!< IWDG Prescaler register,    Address offset: 0x04 */
  __IO uint32_t RLR;              /*!< IWDG Reload register,       Address offset: 0x08 */
  __IO uint32_t SR;               /*!< IWDG Status register,       Address offset: 0x0C */
  __IO uint32_t WINR;             /*!< IWDG Window register,       Address offset: 0x10 */
  __IO uint32_t EWCR;             /*!< IWDG Early Wakeup register, Address offset: 0x14 */
} IWDG_TypeDef;


/**
  * @brief LPTIMER
  */
typedef struct
{
  __IO uint32_t ISR;              /*!< LPTIM Interrupt and Status register,    Address offset: 0x00 */
  __IO uint32_t ICR;              /*!< LPTIM Interrupt Clear register,         Address offset: 0x04 */
  __IO uint32_t DIER;             /*!< LPTIM Interrupt Enable register,        Address offset: 0x08 */
  __IO uint32_t CFGR;             /*!< LPTIM Configuration register,           Address offset: 0x0C */
  __IO uint32_t CR;               /*!< LPTIM Control register,                 Address offset: 0x10 */
  __IO uint32_t CCR1;             /*!< LPTIM Capture/Compare register 1,       Address offset: 0x14 */
  __IO uint32_t ARR;              /*!< LPTIM Autoreload register,              Address offset: 0x18 */
  __IO uint32_t CNT;              /*!< LPTIM Counter register,                 Address offset: 0x1C */
  __IO uint32_t RESERVED0;        /*!< Reserved,                               Address offset: 0x20 */
  __IO uint32_t CFGR2;            /*!< LPTIM Configuration register 2,         Address offset: 0x24 */
  __IO uint32_t RCR;              /*!< LPTIM Repetition register,              Address offset: 0x28 */
  __IO uint32_t CCMR1;            /*!< LPTIM Capture/Compare mode register,    Address offset: 0x2C */
  __IO uint32_t RESERVED1;        /*!< Reserved,                               Address offset: 0x30 */
  __IO uint32_t CCR2;             /*!< LPTIM Capture/Compare register 2,       Address offset: 0x34 */
} LPTIM_TypeDef;

/**
  * @brief MDF/ADF
  */
typedef struct
{
  __IO uint32_t GCR;              /*!< MDF Global Control register,            Address offset: 0x00  */
  __IO uint32_t CKGCR;            /*!< MDF Clock Generator Control Register,   Address offset: 0x04  */
 uint32_t       RESERVED0[6];     /*!< Reserved, 0x08-0x1C                                           */
  __IO uint32_t TRGISELR;         /*!< MDF Trigger Input Selection Register,   Address offset: 0x20  */
} MDF_TypeDef;

/**
  * @brief MDF/ADF filter
  */
typedef struct
{
 __IO uint32_t SITFCR;            /*!< MDF Serial Interface Control Register,          Address offset: 0x80 */
 __IO uint32_t BSMXCR;            /*!< MDF Bitstream Matrix Control Register,          Address offset: 0x84 */
 __IO uint32_t DFLTCR;            /*!< MDF Digital Filter Control Register,            Address offset: 0x88 */
 __IO uint32_t DFLTCICR;          /*!< MDF MCIC Configuration Register,                Address offset: 0x8C */
 __IO uint32_t DFLTRSFR;          /*!< MDF Reshape Filter Configuration Register,      Address offset: 0x90 */
 uint32_t      RESERVED0[4];      /*!< Reserved, 0x94-0xA0                                                  */
 __IO uint32_t DLYCR;             /*!< MDF Delay control Register,                     Address offset: 0xA4 */
 uint32_t      RESERVED1[1];      /*!< Reserved, 0xA8                                                       */
 __IO uint32_t DFLTIER;           /*!< MDF DFLT Interrupt enable Register,             Address offset: 0xAC */
 __IO uint32_t DFLTISR;           /*!< MDF DFLT Interrupt status Register,             Address offset: 0xB0 */
 uint32_t      RESERVED2[1];      /*!< Reserved, 0xB4                                                       */
 __IO uint32_t SADCR;             /*!< MDF SAD Control Register,                       Address offset: 0xB8 */
 __IO uint32_t SADCFGR;           /*!< MDF SAD configuration register,                 Address offset: 0xBC */
 __IO uint32_t SADSDLVR;          /*!< MDF SAD Sound level Register,                   Address offset: 0xC0 */
 __IO uint32_t SADANLVR;          /*!< MDF SAD Ambient Noise level Register,           Address offset: 0xC4 */
 uint32_t      RESERVED3[10];     /*!< Reserved, 0xC8-0xEC                                                  */
 __IO uint32_t DFLTDR;            /*!< MDF Digital Filter Data Register,               Address offset: 0xF0 */
} MDF_Filter_TypeDef;

/**
  * @brief Operational Amplifier (OPAMP)
  */
typedef struct
{
  __IO uint32_t CSR;              /*!< OPAMP control/status register,                     Address offset: 0x00 */
  __IO uint32_t OTR;              /*!< OPAMP offset trimming register for normal mode,    Address offset: 0x04 */
  __IO uint32_t LPOTR;            /*!< OPAMP offset trimming register for low power mode, Address offset: 0x08 */
} OPAMP_TypeDef;

typedef struct
{
  __IO uint32_t CSR;              /*!< OPAMP control/status register, used for bits common to
                                    several OPAMP instances, Address offset: 0x00         */
} OPAMP_Common_TypeDef;

/**
  * @brief Power Control
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< Power control register 1,                          Address offset: 0x00 */
  __IO uint32_t CR2;              /*!< Power control register 2,                          Address offset: 0x04 */
  __IO uint32_t CR3;              /*!< Power control register 3,                          Address offset: 0x08 */
  __IO uint32_t VOSR;             /*!< Power voltage scaling register,                    Address offset: 0x0C */
  __IO uint32_t SVMCR;            /*!< Power supply voltage monitoring control register,  Address offset: 0x10 */
  __IO uint32_t WUCR1;            /*!< Power wakeup control register 1,                   Address offset: 0x14 */
  __IO uint32_t WUCR2;            /*!< Power wakeup control register 2,                   Address offset: 0x18 */
  __IO uint32_t WUCR3;            /*!< Power wakeup control register 3,                   Address offset: 0x1C */
  uint32_t      RESERVED1;        /*!< Reserved,                                          Address offset: 0x20 */
  __IO uint32_t BDCR;             /*!< Power backup domain control register,              Address offset: 0x24 */
  __IO uint32_t DBPR;             /*!< Power disable backup domain register,              Address offset: 0x28 */
  uint32_t      RESERVED2;        /*!< Reserved,                                          Address offset: 0x2C */
  __IO uint32_t SECCFGR;          /*!< Power Security configuration register,             Address offset: 0x30 */
  __IO uint32_t PRIVCFGR;         /*!< Power privilege control register,                  Address offset: 0x34 */
  __IO uint32_t SR;               /*!< Power status register,                             Address offset: 0x38 */
  __IO uint32_t SVMSR;            /*!< Power supply voltage monitoring status register,   Address offset: 0x3C */
  uint32_t      RESERVED3;        /*!< Reserved,                                          Address offset: 0x20 */
  __IO uint32_t WUSR;             /*!< Power wakeup status register,                      Address offset: 0x44 */
  __IO uint32_t WUSCR;            /*!< Power wakeup status clear register,                Address offset: 0x48 */
  __IO uint32_t APCR;             /*!< Power apply pull configuration register,           Address offset: 0x4C */
  __IO uint32_t PUCRA;            /*!< Power Port A pull-up control register,             Address offset: 0x50 */
  __IO uint32_t PDCRA;            /*!< Power Port A pull-down control register,           Address offset: 0x54 */
  __IO uint32_t PUCRB;            /*!< Power Port B pull-up control register,             Address offset: 0x58 */
  __IO uint32_t PDCRB;            /*!< Power Port B pull-down control register,           Address offset: 0x5C */
  __IO uint32_t PUCRC;            /*!< Power Port C pull-up control register,             Address offset: 0x60 */
  __IO uint32_t PDCRC;            /*!< Power Port C pull-down control register,           Address offset: 0x64 */
  __IO uint32_t PUCRD;            /*!< Power Port D pull-up control register,             Address offset: 0x68 */
  __IO uint32_t PDCRD;            /*!< Power Port D pull-down control register,           Address offset: 0x6C */
  __IO uint32_t PUCRE;            /*!< Power Port E pull-up control register,             Address offset: 0x70 */
  __IO uint32_t PDCRE;            /*!< Power Port E pull-down control register,           Address offset: 0x74 */
  uint32_t      RESERVED4[2];     /*!< Reserved,                                          Address offset: 0x78 -> 0x7C */
  __IO uint32_t PUCRG;            /*!< Power Port G pull-up control register,             Address offset: 0x80 */
  __IO uint32_t PDCRG;            /*!< Power Port G pull-down control register,           Address offset: 0x84 */
  __IO uint32_t PUCRH;            /*!< Power Port H pull-up control register,             Address offset: 0x88 */
  __IO uint32_t PDCRH;            /*!< Power Port H pull-down control register,           Address offset: 0x8C */
  uint32_t      RESERVED5[8];     /*!< Reserved,                                          Address offset: 0x90 -> 0xAC */
  __IO uint32_t I3CPUCR1;         /*!< Power I3C pull-up control register 1,              Address offset: 0xB0 */
  __IO uint32_t I3CPUCR2;         /*!< Power I3C pull-up control register 2,              Address offset: 0xB4 */
} PWR_TypeDef;

/**
  * @brief SRAMs configuration controller
  */
typedef struct
{
  __IO uint32_t CR;           /*!< Control Register,                  Address offset: 0x00 */
  __IO uint32_t IER;          /*!< Interrupt enable register,         Address offset: 0x04 */
  __IO uint32_t ISR;          /*!< Interrupt status register,         Address offset: 0x08 */
  uint32_t      RESERVED0;    /*!< Reserved,                          Address offset: 0x0C */
  __IO uint32_t PEAR;         /*!< Parity error address register,     Address offset: 0x10 */
  __IO uint32_t ICR;          /*!< Interrupt clear register,          Address offset: 0x14 */
  __IO uint32_t WPR1;         /*!< Write protection register 1,       Address offset: 0x18 */
  __IO uint32_t WPR2;         /*!< Write protection register 2,       Address offset: 0x1C */
  uint32_t      RESERVED1;    /*!< Reserved,                          Address offset: 0x20 */
  __IO uint32_t PARKEYR;      /*!< Parity key register,               Address offset: 0x24 */
  __IO uint32_t ERKEYR;       /*!< Erase key register,                Address offset: 0x28 */
}RAMCFG_TypeDef;

/**
  * @brief Reset and Clock Control
  */
typedef struct
{
  __IO uint32_t CR;               /*!< RCC Clock Control Register                               Address offset: 0x000 */
  uint32_t      RESERVED0;        /*!< Reserved                                                 Address offset: 0x004 */
  __IO uint32_t ICSCR1;           /*!< RCC Internal Clock Sources Calibration Register 1        Address offset: 0x008 */
  __IO uint32_t ICSCR2;           /*!< RCC Internal Clock Sources Calibration Register 2        Address offset: 0x00C */
  __IO uint32_t ICSCR3;           /*!< RCC Internal Clock Sources Calibration Register 3        Address offset: 0x010 */
  __IO uint32_t CRRCR;            /*!< RCC Clock Recovery RC Register                           Address offset: 0x014 */
  uint32_t      RESERVED1;        /*!< Reserved                                                 Address offset: 0x018 */
  __IO uint32_t CFGR1;            /*!< RCC Clock Configuration Register 1                       Address offset: 0x01C */
  __IO uint32_t CFGR2;            /*!< RCC Clock Configuration Register 2                       Address offset: 0x020 */
  __IO uint32_t CFGR3;            /*!< RCC Clock Configuration Register 3                       Address offset: 0x024 */
  __IO uint32_t CFGR4;            /*!< RCC Clock Configuration Register 4                       Address offset: 0x028 */
  uint32_t      RESERVED2[9];     /*!< Reserved                                                 Address offset: 0x02C */
  __IO uint32_t CIER;             /*!< Clock Interrupt Enable Register                          Address offset: 0x050 */
  __IO uint32_t CIFR;             /*!< Clock Interrupt Flag Register                            Address offset: 0x054 */
  __IO uint32_t CICR;             /*!< Clock Interrupt Clear Register                           Address offset: 0x058 */
  uint32_t      RESERVED3;        /*!< Reserved                                                 Address offset: 0x05C */
  __IO uint32_t AHB1RSTR1;        /*!< AHB1 Peripherals Reset Register 1                        Address offset: 0x060 */
  __IO uint32_t AHB2RSTR1;        /*!< AHB2 Peripherals Reset Register 1                        Address offset: 0x064 */
  __IO uint32_t AHB2RSTR2;        /*!< AHB2 Peripherals Reset Register 2                        Address offset: 0x068 */
  uint32_t      RESERVED4[2];     /*!< Reserved                                                 Address offset: 0x06C */
  __IO uint32_t APB1RSTR1;        /*!< APB1 Peripherals Reset Register 1                        Address offset: 0x074 */
  __IO uint32_t APB1RSTR2;        /*!< APB1 Peripherals Reset Register 2                        Address offset: 0x078 */
  __IO uint32_t APB2RSTR;         /*!< APB2 Peripherals Reset Register                          Address offset: 0x07C */
  __IO uint32_t APB3RSTR;         /*!< APB3 Peripherals Reset Register                          Address offset: 0x080 */
  uint32_t      RESERVED5;        /*!< Reserved                                                 Address offset: 0x084 */
  __IO uint32_t AHB1ENR1;         /*!< AHB1 Peripherals Clock Enable Register 1                 Address offset: 0x088 */
  __IO uint32_t AHB2ENR1;         /*!< AHB2 Peripherals Clock Enable Register 1                 Address offset: 0x08C */
  __IO uint32_t AHB2ENR2;         /*!< AHB2 Peripherals Clock Enable Register 2                 Address offset: 0x090 */
  __IO uint32_t AHB1ENR2;         /*!< AHB1 Peripherals Clock Enable Register 2                 Address offset: 0x094 */
  uint32_t      RESERVED6;        /*!< Reserved                                                 Address offset: 0x098 */
  __IO uint32_t APB1ENR1;         /*!< APB1 Peripherals Clock Enable Register 1                 Address offset: 0x09C */
  __IO uint32_t APB1ENR2;         /*!< APB1 Peripherals Clock Enable Register 2                 Address offset: 0x0A0 */
  __IO uint32_t APB2ENR;          /*!< APB2 Peripherals Clock Enable Register                   Address offset: 0x0A4 */
  __IO uint32_t APB3ENR;          /*!< APB3 Peripherals Clock Enable Register                   Address offset: 0x0A8 */
  uint32_t      RESERVED7;        /*!< Reserved                                                 Address offset: 0x0AC */
  __IO uint32_t AHB1SLPENR1;      /*!< AHB1 Peripherals Clock Enable in Sleep Mode Register 1   Address offset: 0x0B0 */
  __IO uint32_t AHB2SLPENR1;      /*!< AHB2 Peripherals Clock Enable in Sleep Mode Register 1   Address offset: 0x0B4 */
  __IO uint32_t AHB2SLPENR2;      /*!< AHB2 Peripherals Clock Enable in Sleep Mode Register 2   Address offset: 0x0B8 */
  __IO uint32_t AHB1SLPENR2;      /*!< AHB1 Peripherals Clock Enable in Sleep Mode Register 2   Address offset: 0x0BC */
  uint32_t      RESERVED8;        /*!< Reserved                                                 Address offset: 0x0C0 */
  __IO uint32_t APB1SLPENR1;      /*!< APB1 Peripherals Clock Enable in Sleep Mode Register 1   Address offset: 0x0C4 */
  __IO uint32_t APB1SLPENR2;      /*!< APB1 Peripherals Clock Enable in Sleep Mode Register 2   Address offset: 0x0C8 */
  __IO uint32_t APB2SLPENR;       /*!< APB2 Peripherals Clock Enable in Sleep Mode Register     Address offset: 0x0CC */
  __IO uint32_t APB3SLPENR;       /*!< APB3 Peripherals Clock Enable in Sleep Mode Register     Address offset: 0x0D0 */
  uint32_t      RESERVED9;        /*!< Reserved                                                 Address offset: 0x0D4 */
  __IO uint32_t AHB1STPENR1;      /*!< AHB1 Peripherals Clock Enable in Stop Mode Register 1    Address offset: 0x0D8 */
  __IO uint32_t AHB2STPENR1;      /*!< AHB2 Peripherals Clock Enable in Stop Mode Register 1    Address offset: 0x0DC */
  uint32_t      RESERVED10[3];    /*!< Reserved                                                 Address offset: 0x0E0 */
  __IO uint32_t APB1STPENR1;      /*!< APB1 Peripherals Clock Enable in Stop Mode Register 1    Address offset: 0x0EC */
  __IO uint32_t APB1STPENR2;      /*!< APB1 Peripherals Clock Enable in Stop Mode Register 2    Address offset: 0x0F0 */
  __IO uint32_t APB2STPENR;       /*!< APB2 Peripherals Clock Enable in Stop Mode Register      Address offset: 0x0F4 */
  __IO uint32_t APB3STPENR;       /*!< APB3 Peripherals Clock Enable in Stop Mode Register      Address offset: 0x0F8 */
       uint32_t RESERVED11;       /*!< Reserved                                                 Address offset: 0x0FC */
  __IO uint32_t CCIPR1;           /*!< Peripherals Independent Clocks Configuration Register 1  Address offset: 0x100 */
  __IO uint32_t CCIPR2;           /*!< Peripherals Independent Clocks Configuration Register 2  Address offset: 0x104 */
  __IO uint32_t CCIPR3;           /*!< Peripherals Independent Clocks Configuration Register 3  Address offset: 0x108 */
  uint32_t      RESERVED12;       /*!< Reserved                                                 Address offset: 0x10C */
  __IO uint32_t BDCR;             /*!< Backup Domain Control Register                           Address offset: 0x110 */
  __IO uint32_t CSR;              /*!< Control & Status Register                                Address offset: 0x114 */
  uint32_t      RESERVED13[6];    /*!< Reserved                                                 Address offset: 0x118 */
  __IO uint32_t SECCFGR;          /*!< RCC Secure Configuration Register                        Address offset: 0x130 */
  __IO uint32_t PRIVCFGR;         /*!< RCC Privilege Configuration Register                     Address offset: 0x134 */
} RCC_TypeDef;

