zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u345xx.h
typedef  XSPIM_TypeDef OCTOSPIM_TypeDef;

/*@}*/ /* end of group STM32U3xx_peripherals */

/* --------  End of section using anonymous unions and disabling warnings  -------- */
#if   defined (__CC_ARM)
  #pragma pop
#elif defined (__ICCARM__)
  /* leave anonymous unions enabled */
#elif defined(__ARMCC_VERSION) && (__ARMCC_VERSION >= 6010050)
  #pragma clang diagnostic pop
#elif defined (__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined (__TMS470__)
  /* anonymous unions are enabled by default */
#elif defined (__TASKING__)
  #pragma warning restore
#elif defined (__CSMC__)
  /* anonymous unions are enabled by default */
#else
  #warning Not supported compiler type
#endif


/* ================================================================================================================== */
/* ================                     Device Specific Peripheral Address Map                       ================ */
/* ================================================================================================================== */
/** @addtogroup STM32U3xx_Peripheral_peripheralAddr
  * @{
  */

/*!< Flash, Peripheral and internal SRAMs base addresses - Non secure */
#define FLASH_BASE_NS                   0x08000000UL  /*!< FLASH non-secure base address        */
#define SYSTEM_FLASH_BASE_NS            0x0BF80000UL  /*!< System FLASH non-secure base address */
#define SRAM1_BASE_NS                   0x20000000UL  /*!< SRAM1 non-secure base address        */
#define SRAM2_BASE_NS                   0x20004000UL  /*!< SRAM2 non-secure base address        */

#define PERIPH_BASE_NS                  0x40000000UL  /*!< Peripheral non-secure base address   */
#define EXTRAM_BASE_NS                  0x90000000UL  /*!< External RAM base address            */
#define EPPB_BASE                       0xE0040000UL  /*!< External Private Peripheral Bus      */

/*!< OTP, Engineering bytes, Option bytes defines */
#define FLASH_OTP_BASE                  (SYSTEM_FLASH_BASE_NS + 0x00020000UL) /*!< FLASH OTP (one-time programmable) base address */
#define FLASH_OTP_SIZE                  0x00000200U                           /*!< 512 bytes OTP (one-time programmable)          */
#define FLASH_ENGY_BASE                 (SYSTEM_FLASH_BASE_NS + 0x00020500UL)
#define PACKAGE_BASE                    (FLASH_ENGY_BASE)                     /*!< Package data register base address     */
#define UID_BASE                        (FLASH_ENGY_BASE + 0x00000200UL)      /*!< Unique device ID register base address */
#define FLASHSIZE_BASE                  (FLASH_ENGY_BASE + 0x000002A0UL)      /*!< Flash size data register base address  */
#define UID64_BASE                      (FLASH_ENGY_BASE + 0x00000500UL)      /*!< 64-bit Unique device Identification    */

/*!< Memory sizes */
/* Internal Flash size */
#define FLASH_SIZE                      ((((*((uint16_t *)FLASHSIZE_BASE)) == 0xFFFFU)) ? 0x40000U : \
                                         ((((*((uint16_t *)FLASHSIZE_BASE)) == 0x0000U)) ? 0x40000U : \
                                           (((uint32_t)(*((uint16_t *)FLASHSIZE_BASE)) & (0xFFFFU)) << 10U)))

/*!< Internal SRAMs size */
#define SRAM1_SIZE                      0x00004000UL  /*!< SRAM1=16k */
#define SRAM2_SIZE                      0x00010000UL  /*!< SRAM2=64k  */

/*!< Peripheral memory map - Non secure */
#define APB1PERIPH_BASE_NS              PERIPH_BASE_NS
#define APB2PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x00010000UL)
#define AHB1PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x00020000UL)
#define APB3PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x00040000UL)
#define AHB2PERIPH_BASE_NS              (PERIPH_BASE_NS + 0x02020000UL)

/*!< APB1 Non secure peripherals */
#define TIM2_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00000000UL)
#define TIM3_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00000400UL)
#define TIM4_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00000800UL)
#define TIM6_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00001000UL)
#define TIM7_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00001400UL)
#define WWDG_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00002C00UL)
#define IWDG_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00003000UL)
#define SPI2_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00003800UL)
#define USART3_BASE_NS                  (APB1PERIPH_BASE_NS + 0x00004800UL)
#define UART4_BASE_NS                   (APB1PERIPH_BASE_NS + 0x00004C00UL)
#define I2C1_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00005400UL)
#define I3C1_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00005C00UL)
#define CRS_BASE_NS                     (APB1PERIPH_BASE_NS + 0x00006000UL)
#define OPAMP1_BASE_NS                  (APB1PERIPH_BASE_NS + 0x00007000UL)
#define OPAMP2_BASE_NS                  (OPAMP1_BASE_NS + 0x0000010UL)
#define RTC_BASE_NS                     (APB1PERIPH_BASE_NS + 0x00007800UL)
#define TAMP_BASE_NS                    (APB1PERIPH_BASE_NS + 0x00007C00UL)
#define LPTIM2_BASE_NS                  (APB1PERIPH_BASE_NS + 0x00009400UL)
#define FDCAN1_BASE_NS                  (APB1PERIPH_BASE_NS + 0x0000A400UL)
#define FDCAN_CONFIG_BASE_NS            (APB1PERIPH_BASE_NS + 0x0000A500UL)
#define SRAMCAN_BASE_NS                 (APB1PERIPH_BASE_NS + 0x0000AC00UL)

/*!< APB2 Non secure peripherals */
#define TIM1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x00002C00UL)
#define SPI1_BASE_NS                    (APB2PERIPH_BASE_NS + 0x00003000UL)
#define USART1_BASE_NS                  (APB2PERIPH_BASE_NS + 0x00003800UL)
#define TIM15_BASE_NS                   (APB2PERIPH_BASE_NS + 0x00004000UL)
#define TIM16_BASE_NS                   (APB2PERIPH_BASE_NS + 0x00004400UL)
#define TIM17_BASE_NS                   (APB2PERIPH_BASE_NS + 0x00004800UL)
#define USB_DRD_BASE_NS                 (APB2PERIPH_BASE_NS + 0x00006000UL)
#define USB_DRD_PMAADDR_NS              (APB2PERIPH_BASE_NS + 0x00006400UL)

/*!< AHB1 Non secure peripherals */
#define GPDMA1_BASE_NS                  (AHB1PERIPH_BASE_NS)
#define GPDMA1_Channel0_BASE_NS         (GPDMA1_BASE_NS + 0x00000050UL)
#define GPDMA1_Channel1_BASE_NS         (GPDMA1_BASE_NS + 0x000000D0UL)
#define GPDMA1_Channel2_BASE_NS         (GPDMA1_BASE_NS + 0x00000150UL)
#define GPDMA1_Channel3_BASE_NS         (GPDMA1_BASE_NS + 0x000001D0UL)
#define GPDMA1_Channel4_BASE_NS         (GPDMA1_BASE_NS + 0x00000250UL)
#define GPDMA1_Channel5_BASE_NS         (GPDMA1_BASE_NS + 0x000002D0UL)
#define GPDMA1_Channel6_BASE_NS         (GPDMA1_BASE_NS + 0x00000350UL)
#define GPDMA1_Channel7_BASE_NS         (GPDMA1_BASE_NS + 0x000003D0UL)
#define GPDMA1_Channel8_BASE_NS         (GPDMA1_BASE_NS + 0x00000450UL)
#define GPDMA1_Channel9_BASE_NS         (GPDMA1_BASE_NS + 0x000004D0UL)
#define GPDMA1_Channel10_BASE_NS        (GPDMA1_BASE_NS + 0x00000550UL)
#define GPDMA1_Channel11_BASE_NS        (GPDMA1_BASE_NS + 0x000005D0UL)
#define FLASH_R_BASE_NS                 (AHB1PERIPH_BASE_NS + 0x00002000UL)
#define CRC_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x00003000UL)
#define TSC_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x00004000UL)
#define RAMCFG_BASE_NS                  (AHB1PERIPH_BASE_NS + 0x00006000UL)
#define RAMCFG_SRAM1_BASE_NS            (RAMCFG_BASE_NS)
#define RAMCFG_SRAM2_BASE_NS            (RAMCFG_BASE_NS + 0x00000040UL)
#define ICACHE_BASE_NS                  (AHB1PERIPH_BASE_NS + 0x00010400UL)
#define PWR_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x00010800UL)
#define RCC_BASE_NS                     (AHB1PERIPH_BASE_NS + 0x00010C00UL)
#define EXTI_BASE_NS                    (AHB1PERIPH_BASE_NS + 0x00012000UL)
#define GTZC_TZSC1_BASE_NS              (AHB1PERIPH_BASE_NS + 0x00012400UL)
#define GTZC_MPCBB1_BASE_NS             (AHB1PERIPH_BASE_NS + 0x00012C00UL)
#define GTZC_MPCBB2_BASE_NS             (AHB1PERIPH_BASE_NS + 0x00013000UL)
#define ADF1_BASE_NS                    (AHB1PERIPH_BASE_NS + 0x00014000UL)
#define ADF1_Filter0_BASE_NS            (ADF1_BASE_NS + 0x00000080UL)

/*!< APB3 Non secure peripherals */
#define SYSCFG_BASE_NS                  (APB3PERIPH_BASE_NS + 0x00000400UL)
#define LPUART1_BASE_NS                 (APB3PERIPH_BASE_NS + 0x00002400UL)
#define I2C3_BASE_NS                    (APB3PERIPH_BASE_NS + 0x00002800UL)
#define LPTIM1_BASE_NS                  (APB3PERIPH_BASE_NS + 0x00004400UL)
#define LPTIM3_BASE_NS                  (APB3PERIPH_BASE_NS + 0x00004800UL)
#define LPTIM4_BASE_NS                  (APB3PERIPH_BASE_NS + 0x00004C00UL)
#define COMP1_BASE_NS                   (APB3PERIPH_BASE_NS + 0x00005400UL)
#define COMP2_BASE_NS                   (COMP1_BASE_NS + 0x00000004UL)

/*!< AHB2 Non secure peripherals */
#define GPIOA_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00000000UL)
#define GPIOB_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00000400UL)
#define GPIOC_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00000800UL)
#define GPIOD_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00000C00UL)
#define GPIOH_BASE_NS                   (AHB2PERIPH_BASE_NS + 0x00001C00UL)
#define ADC1_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x00008000UL)
#define ADC1_COMMON_BASE_NS             (AHB2PERIPH_BASE_NS + 0x00008300UL)
#define DAC1_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x00008400UL)
#define AES_BASE_NS                     (AHB2PERIPH_BASE_NS + 0x000A0000UL)
#define HASH_BASE_NS                    (AHB2PERIPH_BASE_NS + 0x000A0400UL)
#define HASH_DIGEST_BASE_NS             (AHB2PERIPH_BASE_NS + 0x000A0710UL)
#define RNG_BASE_NS                     (AHB2PERIPH_BASE_NS + 0x000A0800UL)
#define DLYB_OCTOSPI1_BASE_NS           (AHB2PERIPH_BASE_NS + 0x000AF000UL)
#define OCTOSPI1_R_BASE_NS              (AHB2PERIPH_BASE_NS + 0x000B1400UL)

#if defined(CPU_IN_SECURE_STATE)
/*!< Flash, Peripheral and internal SRAMs base addresses - secure */
#define FLASH_BASE_S                    0x0C000000UL  /*!< FLASH secure base address        */
#define SYSTEM_FLASH_BASE_S             0x0FF80000UL  /*!< System FLASH secure base address */
#define SRAM1_BASE_S                    0x30000000UL  /*!< SRAM1 secure base address        */
#define SRAM2_BASE_S                    0x30004000UL  /*!< SRAM2 secure base address        */
#define PERIPH_BASE_S                   0x50000000UL  /*!< Peripheral secure base address   */

