zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u345xx.h
/*******************  Bit definition for EXTI_SECENR1 register  ******************/
#define EXTI_SECCFGR1_RPIF0_Pos             (0UL)
#define EXTI_SECCFGR1_RPIF0_Msk             (0x1UL << EXTI_SECCFGR1_RPIF0_Pos)      /*!< 0x00000001 */
#define EXTI_SECCFGR1_RPIF0                 EXTI_SECCFGR1_RPIF0_Msk                 /*!< Security enable on line 0 */
#define EXTI_SECCFGR1_RPIF1_Pos             (1UL)
#define EXTI_SECCFGR1_RPIF1_Msk             (0x1UL << EXTI_SECCFGR1_RPIF1_Pos)      /*!< 0x00000002 */
#define EXTI_SECCFGR1_RPIF1                 EXTI_SECCFGR1_RPIF1_Msk                 /*!< Security enable on line 1 */
#define EXTI_SECCFGR1_RPIF2_Pos             (2UL)
#define EXTI_SECCFGR1_RPIF2_Msk             (0x1UL << EXTI_SECCFGR1_RPIF2_Pos)      /*!< 0x00000004 */
#define EXTI_SECCFGR1_RPIF2                 EXTI_SECCFGR1_RPIF2_Msk                 /*!< Security enable on line 2 */
#define EXTI_SECCFGR1_RPIF3_Pos             (3UL)
#define EXTI_SECCFGR1_RPIF3_Msk             (0x1UL << EXTI_SECCFGR1_RPIF3_Pos)      /*!< 0x00000008 */
#define EXTI_SECCFGR1_RPIF3                 EXTI_SECCFGR1_RPIF3_Msk                 /*!< Security enable on line 3 */
#define EXTI_SECCFGR1_RPIF4_Pos             (4UL)
#define EXTI_SECCFGR1_RPIF4_Msk             (0x1UL << EXTI_SECCFGR1_RPIF4_Pos)      /*!< 0x00000010 */
#define EXTI_SECCFGR1_RPIF4                 EXTI_SECCFGR1_RPIF4_Msk                 /*!< Security enable on line 4 */
#define EXTI_SECCFGR1_RPIF5_Pos             (5UL)
#define EXTI_SECCFGR1_RPIF5_Msk             (0x1UL << EXTI_SECCFGR1_RPIF5_Pos)      /*!< 0x00000020 */
#define EXTI_SECCFGR1_RPIF5                 EXTI_SECCFGR1_RPIF5_Msk                 /*!< Security enable on line 5 */
#define EXTI_SECCFGR1_RPIF6_Pos             (6UL)
#define EXTI_SECCFGR1_RPIF6_Msk             (0x1UL << EXTI_SECCFGR1_RPIF6_Pos)      /*!< 0x00000040 */
#define EXTI_SECCFGR1_RPIF6                 EXTI_SECCFGR1_RPIF6_Msk                 /*!< Security enable on line 6 */
#define EXTI_SECCFGR1_RPIF7_Pos             (7UL)
#define EXTI_SECCFGR1_RPIF7_Msk             (0x1UL << EXTI_SECCFGR1_RPIF7_Pos)      /*!< 0x00000080 */
#define EXTI_SECCFGR1_RPIF7                 EXTI_SECCFGR1_RPIF7_Msk                 /*!< Security enable on line 7 */
#define EXTI_SECCFGR1_RPIF8_Pos             (8UL)
#define EXTI_SECCFGR1_RPIF8_Msk             (0x1UL << EXTI_SECCFGR1_RPIF8_Pos)      /*!< 0x00000100 */
#define EXTI_SECCFGR1_RPIF8                 EXTI_SECCFGR1_RPIF8_Msk                 /*!< Security enable on line 8 */
#define EXTI_SECCFGR1_RPIF9_Pos             (9UL)
#define EXTI_SECCFGR1_RPIF9_Msk             (0x1UL << EXTI_SECCFGR1_RPIF9_Pos)      /*!< 0x00000200 */
#define EXTI_SECCFGR1_RPIF9                 EXTI_SECCFGR1_RPIF9_Msk                 /*!< Security enable on line 9 */
#define EXTI_SECCFGR1_RPIF10_Pos            (10UL)
#define EXTI_SECCFGR1_RPIF10_Msk            (0x1UL << EXTI_SECCFGR1_RPIF10_Pos)     /*!< 0x00000400 */
#define EXTI_SECCFGR1_RPIF10                EXTI_SECCFGR1_RPIF10_Msk                /*!< Security enable on line 10 */
#define EXTI_SECCFGR1_RPIF11_Pos            (11UL)
#define EXTI_SECCFGR1_RPIF11_Msk            (0x1UL << EXTI_SECCFGR1_RPIF11_Pos)     /*!< 0x00000800 */
#define EXTI_SECCFGR1_RPIF11                EXTI_SECCFGR1_RPIF11_Msk                /*!< Security enable on line 11 */
#define EXTI_SECCFGR1_RPIF12_Pos            (12UL)
#define EXTI_SECCFGR1_RPIF12_Msk            (0x1UL << EXTI_SECCFGR1_RPIF12_Pos)     /*!< 0x00001000 */
#define EXTI_SECCFGR1_RPIF12                EXTI_SECCFGR1_RPIF12_Msk                /*!< Security enable on line 12 */
#define EXTI_SECCFGR1_RPIF13_Pos            (13UL)
#define EXTI_SECCFGR1_RPIF13_Msk            (0x1UL << EXTI_SECCFGR1_RPIF13_Pos)     /*!< 0x00002000 */
#define EXTI_SECCFGR1_RPIF13                EXTI_SECCFGR1_RPIF13_Msk                /*!< Security enable on line 13 */
#define EXTI_SECCFGR1_RPIF14_Pos            (14UL)
#define EXTI_SECCFGR1_RPIF14_Msk            (0x1UL << EXTI_SECCFGR1_RPIF14_Pos)     /*!< 0x00004000 */
#define EXTI_SECCFGR1_RPIF14                EXTI_SECCFGR1_RPIF14_Msk                /*!< Security enable on line 14 */
#define EXTI_SECCFGR1_RPIF15_Pos            (15UL)
#define EXTI_SECCFGR1_RPIF15_Msk            (0x1UL << EXTI_SECCFGR1_RPIF15_Pos)     /*!< 0x00008000 */
#define EXTI_SECCFGR1_RPIF15                EXTI_SECCFGR1_RPIF15_Msk                /*!< Security enable on line 15 */
#define EXTI_SECCFGR1_RPIF16_Pos            (16UL)
#define EXTI_SECCFGR1_RPIF16_Msk            (0x1UL << EXTI_SECCFGR1_RPIF16_Pos)     /*!< 0x00010000 */
#define EXTI_SECCFGR1_RPIF16                EXTI_SECCFGR1_RPIF16_Msk                /*!< Security enable on line 16 */
#define EXTI_SECCFGR1_RPIF17_Pos            (17UL)
#define EXTI_SECCFGR1_RPIF17_Msk            (0x1UL << EXTI_SECCFGR1_RPIF17_Pos)     /*!< 0x00020000 */
#define EXTI_SECCFGR1_RPIF17                EXTI_SECCFGR1_RPIF17_Msk                /*!< Security enable on line 17 */
#define EXTI_SECCFGR1_RPIF18_Pos            (18UL)
#define EXTI_SECCFGR1_RPIF18_Msk            (0x1UL << EXTI_SECCFGR1_RPIF18_Pos)     /*!< 0x00040000 */
#define EXTI_SECCFGR1_RPIF18                EXTI_SECCFGR1_RPIF18_Msk                /*!< Security enable on line 18 */
#define EXTI_SECCFGR1_RPIF19_Pos            (19UL)
#define EXTI_SECCFGR1_RPIF19_Msk            (0x1UL << EXTI_SECCFGR1_RPIF19_Pos)     /*!< 0x00080000 */
#define EXTI_SECCFGR1_RPIF19                EXTI_SECCFGR1_RPIF19_Msk                /*!< Security enable on line 19 */
#define EXTI_SECCFGR1_RPIF20_Pos            (20UL)
#define EXTI_SECCFGR1_RPIF20_Msk            (0x1UL << EXTI_SECCFGR1_RPIF20_Pos)     /*!< 0x00100000 */
#define EXTI_SECCFGR1_RPIF20                EXTI_SECCFGR1_RPIF20_Msk                /*!< Security enable on line 20 */
#define EXTI_SECCFGR1_RPIF21_Pos            (21UL)
#define EXTI_SECCFGR1_RPIF21_Msk            (0x1UL << EXTI_SECCFGR1_RPIF21_Pos)     /*!< 0x00200000 */
#define EXTI_SECCFGR1_RPIF21                EXTI_SECCFGR1_RPIF21_Msk                /*!< Security enable on line 21 */
#define EXTI_SECCFGR1_RPIF22_Pos            (22UL)
#define EXTI_SECCFGR1_RPIF22_Msk            (0x1UL << EXTI_SECCFGR1_RPIF22_Pos)     /*!< 0x00400000 */
#define EXTI_SECCFGR1_RPIF22                EXTI_SECCFGR1_RPIF22_Msk                /*!< Security enable on line 22 */

