zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u345xx.h
/*******************  Bits definition for GTZC_TZIC1_SR1 register  ***************/
#define GTZC_TZIC1_SR1_TIM2_Pos                 GTZC_CFGR1_TIM2_Pos
#define GTZC_TZIC1_SR1_TIM2_Msk                 GTZC_CFGR1_TIM2_Msk
#define GTZC_TZIC1_SR1_TIM3_Pos                 GTZC_CFGR1_TIM3_Pos
#define GTZC_TZIC1_SR1_TIM3_Msk                 GTZC_CFGR1_TIM3_Msk
#define GTZC_TZIC1_SR1_TIM4_Pos                 GTZC_CFGR1_TIM4_Pos
#define GTZC_TZIC1_SR1_TIM4_Msk                 GTZC_CFGR1_TIM4_Msk
#define GTZC_TZIC1_SR1_TIM5_Pos                 GTZC_CFGR1_TIM5_Pos
#define GTZC_TZIC1_SR1_TIM5_Msk                 GTZC_CFGR1_TIM5_Msk
#define GTZC_TZIC1_SR1_TIM6_Pos                 GTZC_CFGR1_TIM6_Pos
#define GTZC_TZIC1_SR1_TIM6_Msk                 GTZC_CFGR1_TIM6_Msk
#define GTZC_TZIC1_SR1_TIM7_Pos                 GTZC_CFGR1_TIM7_Pos
#define GTZC_TZIC1_SR1_TIM7_Msk                 GTZC_CFGR1_TIM7_Msk
#define GTZC_TZIC1_SR1_WWDG_Pos                 GTZC_CFGR1_WWDG_Pos
#define GTZC_TZIC1_SR1_WWDG_Msk                 GTZC_CFGR1_WWDG_Msk
#define GTZC_TZIC1_SR1_IWDG_Pos                 GTZC_CFGR1_IWDG_Pos
#define GTZC_TZIC1_SR1_IWDG_Msk                 GTZC_CFGR1_IWDG_Msk
#define GTZC_TZIC1_SR1_SPI2_Pos                 GTZC_CFGR1_SPI2_Pos
#define GTZC_TZIC1_SR1_SPI2_Msk                 GTZC_CFGR1_SPI2_Msk
#define GTZC_TZIC1_SR1_USART3_Pos               GTZC_CFGR1_USART3_Pos
#define GTZC_TZIC1_SR1_USART3_Msk               GTZC_CFGR1_USART3_Msk
#define GTZC_TZIC1_SR1_UART4_Pos                GTZC_CFGR1_UART4_Pos
#define GTZC_TZIC1_SR1_UART4_Msk                GTZC_CFGR1_UART4_Msk
#define GTZC_TZIC1_SR1_I2C1_Pos                 GTZC_CFGR1_I2C1_Pos
#define GTZC_TZIC1_SR1_I2C1_Msk                 GTZC_CFGR1_I2C1_Msk
#define GTZC_TZIC1_SR1_CRS_Pos                  GTZC_CFGR1_CRS_Pos
#define GTZC_TZIC1_SR1_CRS_Msk                  GTZC_CFGR1_CRS_Msk
#define GTZC_TZIC1_SR1_LPTIM2_Pos               GTZC_CFGR1_LPTIM2_Pos
#define GTZC_TZIC1_SR1_LPTIM2_Msk               GTZC_CFGR1_LPTIM2_Msk
#define GTZC_TZIC1_SR1_FDCAN1_Pos               GTZC_CFGR1_FDCAN1_Pos
#define GTZC_TZIC1_SR1_FDCAN1_Msk               GTZC_CFGR1_FDCAN1_Msk
#define GTZC_TZIC1_SR1_I3C1_Pos                 GTZC_CFGR1_I3C1_Pos
#define GTZC_TZIC1_SR1_I3C1_Msk                 GTZC_CFGR1_I3C1_Msk
#define GTZC_TZIC1_SR1_OPAMP_Pos                GTZC_CFGR1_OPAMP_Pos
#define GTZC_TZIC1_SR1_OPAMP_Msk                GTZC_CFGR1_OPAMP_Msk

/*******************  Bits definition for GTZC_TZIC1_SR2 register  ***************/
#define GTZC_TZIC1_SR2_TIM1_Pos                 GTZC_CFGR2_TIM1_Pos
#define GTZC_TZIC1_SR2_TIM1_Msk                 GTZC_CFGR2_TIM1_Msk
#define GTZC_TZIC1_SR2_SPI1_Pos                 GTZC_CFGR2_SPI1_Pos
#define GTZC_TZIC1_SR2_SPI1_Msk
#define GTZC_TZIC1_SR2_USART1_Pos               GTZC_CFGR2_USART1_Pos
#define GTZC_TZIC1_SR2_USART1_Msk               GTZC_CFGR2_USART1_Msk
#define GTZC_TZIC1_SR2_TIM15_Pos                GTZC_CFGR2_TIM15_Pos
#define GTZC_TZIC1_SR2_TIM15_Msk                GTZC_CFGR2_TIM15_Msk
#define GTZC_TZIC1_SR2_TIM16_Pos                GTZC_CFGR2_TIM16_Pos
#define GTZC_TZIC1_SR2_TIM16_Msk                GTZC_CFGR2_TIM16_Msk
#define GTZC_TZIC1_SR2_TIM17_Pos                GTZC_CFGR2_TIM17_Pos
#define GTZC_TZIC1_SR2_TIM17_Msk                GTZC_CFGR2_TIM17_Msk
#define GTZC_TZIC1_SR2_USB_Pos                  GTZC_CFGR2_USB_Pos
#define GTZC_TZIC1_SR2_USB_Msk                  GTZC_CFGR2_USB_Msk
#define GTZC_TZIC1_SR2_LPUART1_Pos              GTZC_CFGR2_LPUART1_Pos
#define GTZC_TZIC1_SR2_LPUART1_Msk              GTZC_CFGR2_LPUART1_Msk
#define GTZC_TZIC1_SR2_I2C3_Pos                 GTZC_CFGR2_I2C3_Pos
#define GTZC_TZIC1_SR2_I2C3_Msk                 GTZC_CFGR2_I2C3_Msk
#define GTZC_TZIC1_SR2_LPTIM1_Pos               GTZC_CFGR2_LPTIM1_Pos
#define GTZC_TZIC1_SR2_LPTIM1_Msk               GTZC_CFGR2_LPTIM1_Msk
#define GTZC_TZIC1_SR2_LPTIM3_Pos               GTZC_CFGR2_LPTIM3_Pos
#define GTZC_TZIC1_SR2_LPTIM3_Msk               GTZC_CFGR2_LPTIM3_Msk
#define GTZC_TZIC1_SR2_LPTIM4_Pos               GTZC_CFGR2_LPTIM4_Pos
#define GTZC_TZIC1_SR2_LPTIM4_Msk               GTZC_CFGR2_LPTIM4_Msk
#define GTZC_TZIC1_SR2_COMP_Pos                 GTZC_CFGR2_COMP_Pos
#define GTZC_TZIC1_SR2_COMP_Msk                 GTZC_CFGR2_COMP_Msk

/*******************  Bits definition for GTZC_TZIC1_SR3 register  ***************/
#define GTZC_TZIC1_SR3_CRC_Pos                  GTZC_CFGR3_CRC_Pos
#define GTZC_TZIC1_SR3_CRC_Msk                  GTZC_CFGR3_CRC_Msk
#define GTZC_TZIC1_SR3_TSC_Pos                  GTZC_CFGR3_TSC_Pos
#define GTZC_TZIC1_SR3_TSC_Msk                  GTZC_CFGR3_TSC_Msk
#define GTZC_TZIC1_SR3_ICACHE_REG_Pos           GTZC_CFGR3_ICACHE_REG_Pos
#define GTZC_TZIC1_SR3_ICACHE_REG_Msk           GTZC_CFGR3_ICACHE_REG_Msk
#define GTZC_TZIC1_SR3_ADC1_Pos                 GTZC_CFGR3_ADC1_Pos
#define GTZC_TZIC1_SR3_ADC1_Msk                 GTZC_CFGR3_ADC1_Msk
#define GTZC_TZIC1_SR3_AES_Pos                  GTZC_CFGR3_AES_Pos
#define GTZC_TZIC1_SR3_AES_Msk                  GTZC_CFGR3_AES_Msk
#define GTZC_TZIC1_SR3_HASH_Pos                 GTZC_CFGR3_HASH_Pos
#define GTZC_TZIC1_SR3_HASH_Msk                 GTZC_CFGR3_HASH_Msk
#define GTZC_TZIC1_SR3_RNG_Pos                  GTZC_CFGR3_RNG_Pos
#define GTZC_TZIC1_SR3_RNG_Msk                  GTZC_CFGR3_RNG_Msk
#define GTZC_TZIC1_SR3_OCTOSPI1_REG_Pos         GTZC_CFGR3_OCTOSPI1_REG_Pos
#define GTZC_TZIC1_SR3_OCTOSPI1_REG_Msk         GTZC_CFGR3_OCTOSPI1_REG_Msk
#define GTZC_TZIC1_SR3_RAMCFG_Pos               GTZC_CFGR3_RAMCFG_Pos
#define GTZC_TZIC1_SR3_RAMCFG_Msk               GTZC_CFGR3_RAMCFG_Msk
#define GTZC_TZIC1_SR3_DAC1_Pos                 GTZC_CFGR3_DAC1_Pos
#define GTZC_TZIC1_SR3_DAC1_Msk                 GTZC_CFGR3_DAC1_Msk
#define GTZC_TZIC1_SR3_ADF1_Pos                 GTZC_CFGR3_ADF1_Pos
#define GTZC_TZIC1_SR3_ADF1_Msk                 GTZC_CFGR3_ADF1_Msk

/*******************  Bits definition for GTZC_TZIC1_SR4 register  ***************/
#define GTZC_TZIC1_SR4_GPDMA1_Pos               GTZC_CFGR4_GPDMA1_Pos
#define GTZC_TZIC1_SR4_GPDMA1_Msk               GTZC_CFGR4_GPDMA1_Msk
#define GTZC_TZIC1_SR4_FLASH_REG_Pos            GTZC_CFGR4_FLASH_REG_Pos
#define GTZC_TZIC1_SR4_FLASH_REG_Msk            GTZC_CFGR4_FLASH_REG_Msk
#define GTZC_TZIC1_SR4_FLASH_Pos                GTZC_CFGR4_FLASH_Pos
#define GTZC_TZIC1_SR4_FLASH_Msk                GTZC_CFGR4_FLASH_Msk
#define GTZC_TZIC1_SR4_PWR_Pos                  GTZC_CFGR4_PWR_Pos
#define GTZC_TZIC1_SR4_PWR_Msk                  GTZC_CFGR4_PWR_Msk
#define GTZC_TZIC1_SR4_RCC_Pos                  GTZC_CFGR4_RCC_Pos
#define GTZC_TZIC1_SR4_RCC_Msk                  GTZC_CFGR4_RCC_Msk
#define GTZC_TZIC1_SR4_SYSCFG_Pos               GTZC_CFGR4_SYSCFG_Pos
#define GTZC_TZIC1_SR4_SYSCFG_Msk               GTZC_CFGR4_SYSCFG_Msk
#define GTZC_TZIC1_SR4_EXTI_Pos                 GTZC_CFGR4_EXTI_Pos
#define GTZC_TZIC1_SR4_EXTI_Msk                 GTZC_CFGR4_EXTI_Msk
#define GTZC_TZIC1_SR4_RTC_Pos                  GTZC_CFGR4_RTC_Pos
#define GTZC_TZIC1_SR4_RTC_Msk                  GTZC_CFGR4_RTC_Msk
#define GTZC_TZIC1_SR4_TAMP_Pos                 GTZC_CFGR4_TAMP_Pos
#define GTZC_TZIC1_SR4_TAMP_Msk                 GTZC_CFGR4_TAMP_Msk
#define GTZC_TZIC1_SR4_TZSC_Pos                 GTZC_CFGR4_TZSC_Pos
#define GTZC_TZIC1_SR4_TZSC_Msk                 GTZC_CFGR4_TZSC_Msk
#define GTZC_TZIC1_SR4_TZIC_Pos                 GTZC_CFGR4_TZIC_Pos
#define GTZC_TZIC1_SR4_TZIC_Msk                 GTZC_CFGR4_TZIC_Msk
#define GTZC_TZIC1_SR4_SRAM1_Pos                GTZC_CFGR4_SRAM1_Pos
#define GTZC_TZIC1_SR4_SRAM1_Msk                GTZC_CFGR4_SRAM1_Msk
#define GTZC_TZIC1_SR4_MPCBB1_REG_Pos           GTZC_CFGR4_MPCBB1_REG_Pos
#define GTZC_TZIC1_SR4_MPCBB1_REG_Msk           GTZC_CFGR4_MPCBB1_REG_Msk
#define GTZC_TZIC1_SR4_SRAM2_Pos                GTZC_CFGR4_SRAM2_Pos
#define GTZC_TZIC1_SR4_SRAM2_Msk                GTZC_CFGR4_SRAM2_Msk
#define GTZC_TZIC1_SR4_MPCBB2_REG_Pos           GTZC_CFGR4_MPCBB2_REG_Pos
#define GTZC_TZIC1_SR4_MPCBB2_REG_Msk           GTZC_CFGR4_MPCBB2_REG_Msk

/******************  Bits definition for GTZC_TZIC1_FCR1 register  ***************/
#define GTZC_TZIC1_FCR1_TIM2_Pos                GTZC_CFGR1_TIM2_Pos
#define GTZC_TZIC1_FCR1_TIM2_Msk                GTZC_CFGR1_TIM2_Msk
#define GTZC_TZIC1_FCR1_TIM3_Pos                GTZC_CFGR1_TIM3_Pos
#define GTZC_TZIC1_FCR1_TIM3_Msk                GTZC_CFGR1_TIM3_Msk
#define GTZC_TZIC1_FCR1_TIM4_Pos                GTZC_CFGR1_TIM4_Pos
#define GTZC_TZIC1_FCR1_TIM4_Msk                GTZC_CFGR1_TIM4_Msk
#define GTZC_TZIC1_FCR1_TIM5_Pos                GTZC_CFGR1_TIM5_Pos
#define GTZC_TZIC1_FCR1_TIM5_Msk                GTZC_CFGR1_TIM5_Msk
#define GTZC_TZIC1_FCR1_TIM6_Pos                GTZC_CFGR1_TIM6_Pos
#define GTZC_TZIC1_FCR1_TIM6_Msk                GTZC_CFGR1_TIM6_Msk
#define GTZC_TZIC1_FCR1_TIM7_Pos                GTZC_CFGR1_TIM7_Pos
#define GTZC_TZIC1_FCR1_TIM7_Msk                GTZC_CFGR1_TIM7_Msk
#define GTZC_TZIC1_FCR1_WWDG_Pos                GTZC_CFGR1_WWDG_Pos
#define GTZC_TZIC1_FCR1_WWDG_Msk                GTZC_CFGR1_WWDG_Msk
#define GTZC_TZIC1_FCR1_IWDG_Pos                GTZC_CFGR1_IWDG_Pos
#define GTZC_TZIC1_FCR1_IWDG_Msk                GTZC_CFGR1_IWDG_Msk
#define GTZC_TZIC1_FCR1_SPI2_Pos                GTZC_CFGR1_SPI2_Pos
#define GTZC_TZIC1_FCR1_SPI2_Msk                GTZC_CFGR1_SPI2_Msk
#define GTZC_TZIC1_FCR1_USART3_Pos              GTZC_CFGR1_USART3_Pos
#define GTZC_TZIC1_FCR1_USART3_Msk              GTZC_CFGR1_USART3_Msk
#define GTZC_TZIC1_FCR1_UART4_Pos               GTZC_CFGR1_UART4_Pos
#define GTZC_TZIC1_FCR1_UART4_Msk               GTZC_CFGR1_UART4_Msk
#define GTZC_TZIC1_FCR1_I2C1_Pos                GTZC_CFGR1_I2C1_Pos
#define GTZC_TZIC1_FCR1_I2C1_Msk                GTZC_CFGR1_I2C1_Msk
#define GTZC_TZIC1_FCR1_CRS_Pos                 GTZC_CFGR1_CRS_Pos
#define GTZC_TZIC1_FCR1_CRS_Msk                 GTZC_CFGR1_CRS_Msk
#define GTZC_TZIC1_FCR1_LPTIM2_Pos              GTZC_CFGR1_LPTIM2_Pos
#define GTZC_TZIC1_FCR1_LPTIM2_Msk              GTZC_CFGR1_LPTIM2_Msk
#define GTZC_TZIC1_FCR1_FDCAN1_Pos              GTZC_CFGR1_FDCAN1_Pos
#define GTZC_TZIC1_FCR1_FDCAN1_Msk              GTZC_CFGR1_FDCAN1_Msk
#define GTZC_TZIC1_FCR1_I3C1_Pos                GTZC_CFGR1_I3C1_Pos
#define GTZC_TZIC1_FCR1_I3C1_Msk                GTZC_CFGR1_I3C1_Msk
#define GTZC_TZIC1_FCR1_OPAMP_Pos               GTZC_CFGR1_OPAMP_Pos
#define GTZC_TZIC1_FCR1_OPAMP_Msk               GTZC_CFGR1_OPAMP_Msk

/******************  Bits definition for GTZC_TZIC1_FCR2 register  ***************/
#define GTZC_TZIC1_FCR2_TIM1_Pos                GTZC_CFGR2_TIM1_Pos
#define GTZC_TZIC1_FCR2_TIM1_Msk                GTZC_CFGR2_TIM1_Msk
#define GTZC_TZIC1_FCR2_SPI1_Pos                GTZC_CFGR2_SPI1_Pos
#define GTZC_TZIC1_FCR2_SPI1_Msk                GTZC_CFGR2_SPI1_Msk
#define GTZC_TZIC1_FCR2_USART1_Pos              GTZC_CFGR2_USART1_Pos
#define GTZC_TZIC1_FCR2_USART1_Msk              GTZC_CFGR2_USART1_Msk
#define GTZC_TZIC1_FCR2_TIM15_Pos               GTZC_CFGR2_TIM15_Pos
#define GTZC_TZIC1_FCR2_TIM15_Msk               GTZC_CFGR2_TIM15_Msk
#define GTZC_TZIC1_FCR2_TIM16_Pos               GTZC_CFGR2_TIM16_Pos
#define GTZC_TZIC1_FCR2_TIM16_Msk               GTZC_CFGR2_TIM16_Msk
#define GTZC_TZIC1_FCR2_TIM17_Pos               GTZC_CFGR2_TIM17_Pos
#define GTZC_TZIC1_FCR2_TIM17_Msk               GTZC_CFGR2_TIM17_Msk
#define GTZC_TZIC1_FCR2_USB_Pos                 GTZC_CFGR2_USB_Pos
#define GTZC_TZIC1_FCR2_USB_Msk                 GTZC_CFGR2_USB_Msk
#define GTZC_TZIC1_FCR2_LPUART1_Pos             GTZC_CFGR2_LPUART1_Pos
#define GTZC_TZIC1_FCR2_LPUART1_Msk             GTZC_CFGR2_LPUART1_Msk
#define GTZC_TZIC1_FCR2_I2C3_Pos                GTZC_CFGR2_I2C3_Pos
#define GTZC_TZIC1_FCR2_I2C3_Msk                GTZC_CFGR2_I2C3_Msk
#define GTZC_TZIC1_FCR2_LPTIM1_Pos              GTZC_CFGR2_LPTIM1_Pos
#define GTZC_TZIC1_FCR2_LPTIM1_Msk              GTZC_CFGR2_LPTIM1_Msk
#define GTZC_TZIC1_FCR2_LPTIM3_Pos              GTZC_CFGR2_LPTIM3_Pos
#define GTZC_TZIC1_FCR2_LPTIM3_Msk              GTZC_CFGR2_LPTIM3_Msk
#define GTZC_TZIC1_FCR2_LPTIM4_Pos              GTZC_CFGR2_LPTIM4_Pos
#define GTZC_TZIC1_FCR2_LPTIM4_Msk              GTZC_CFGR2_LPTIM4_Msk
#define GTZC_TZIC1_FCR2_COMP_Pos                GTZC_CFGR2_COMP_Pos
#define GTZC_TZIC1_FCR2_COMP_Msk                GTZC_CFGR2_COMP_Msk

/******************  Bits definition for GTZC_TZIC1_FCR3 register  ***************/
#define GTZC_TZIC1_FCR3_CRC_Pos                 GTZC_CFGR3_CRC_Pos
#define GTZC_TZIC1_FCR3_CRC_Msk                 GTZC_CFGR3_CRC_Msk
#define GTZC_TZIC1_FCR3_TSC_Pos                 GTZC_CFGR3_TSC_Pos
#define GTZC_TZIC1_FCR3_TSC_Msk                 GTZC_CFGR3_TSC_Msk
#define GTZC_TZIC1_FCR3_ICACHE_REG_Pos          GTZC_CFGR3_ICACHE_REG_Pos
#define GTZC_TZIC1_FCR3_ICACHE_REG_Msk          GTZC_CFGR3_ICACHE_REG_Msk
#define GTZC_TZIC1_FCR3_ADC1_Pos                GTZC_CFGR3_ADC1_Pos
#define GTZC_TZIC1_FCR3_ADC1_Msk                GTZC_CFGR3_ADC1_Msk
#define GTZC_TZIC1_FCR3_AES_Pos                 GTZC_CFGR3_AES_Pos
#define GTZC_TZIC1_FCR3_AES_Msk                 GTZC_CFGR3_AES_Msk
#define GTZC_TZIC1_FCR3_HASH_Pos                GTZC_CFGR3_HASH_Pos
#define GTZC_TZIC1_FCR3_HASH_Msk                GTZC_CFGR3_HASH_Msk
#define GTZC_TZIC1_FCR3_RNG_Pos                 GTZC_CFGR3_RNG_Pos
#define GTZC_TZIC1_FCR3_RNG_Msk                 GTZC_CFGR3_RNG_Msk
#define GTZC_TZIC1_FCR3_OCTOSPI1_REG_Pos        GTZC_CFGR3_OCTOSPI1_REG_Pos
#define GTZC_TZIC1_FCR3_OCTOSPI1_REG_Msk        GTZC_CFGR3_OCTOSPI1_REG_Msk
#define GTZC_TZIC1_FCR3_RAMCFG_Pos              GTZC_CFGR3_RAMCFG_Pos
#define GTZC_TZIC1_FCR3_RAMCFG_Msk              GTZC_CFGR3_RAMCFG_Msk
#define GTZC_TZIC1_FCR3_DAC1_Pos                GTZC_CFGR3_DAC1_Pos
#define GTZC_TZIC1_FCR3_DAC1_Msk                GTZC_CFGR3_DAC1_Msk
#define GTZC_TZIC1_FCR3_ADF1_Pos                GTZC_CFGR3_ADF1_Pos
#define GTZC_TZIC1_FCR3_ADF1_Msk                GTZC_CFGR3_ADF1_Msk

