zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u345xx.h
/*******************  Bit definition for I3C_CEVR register  *******************/
#define I3C_CEVR_CFCF_Pos                   (9UL)
#define I3C_CEVR_CFCF_Msk                   (0x1UL << I3C_CEVR_CFCF_Pos)            /*!< 0x00000200 */
#define I3C_CEVR_CFCF                       I3C_CEVR_CFCF_Msk                       /*!< Frame Complete Clear Flag */
#define I3C_CEVR_CRXTGTENDF_Pos             (10UL)
#define I3C_CEVR_CRXTGTENDF_Msk             (0x1UL << I3C_CEVR_CRXTGTENDF_Pos)      /*!< 0x00000400 */
#define I3C_CEVR_CRXTGTENDF                 I3C_CEVR_CRXTGTENDF_Msk                 /*!< Reception Target End Clear Flag */
#define I3C_CEVR_CERRF_Pos                  (11UL)
#define I3C_CEVR_CERRF_Msk                  (0x1UL << I3C_CEVR_CERRF_Pos)           /*!< 0x00000800 */
#define I3C_CEVR_CERRF                      I3C_CEVR_CERRF_Msk                      /*!< Error Clear Flag */
#define I3C_CEVR_CIBIF_Pos                  (15UL)
#define I3C_CEVR_CIBIF_Msk                  (0x1UL << I3C_CEVR_CIBIF_Pos)           /*!< 0x00008000 */
#define I3C_CEVR_CIBIF                      I3C_CEVR_CIBIF_Msk                      /*!< IBI Clear Flag */
#define I3C_CEVR_CIBIENDF_Pos               (16UL)
#define I3C_CEVR_CIBIENDF_Msk               (0x1UL << I3C_CEVR_CIBIENDF_Pos)        /*!< 0x00010000 */
#define I3C_CEVR_CIBIENDF                   I3C_CEVR_CIBIENDF_Msk                   /*!< IBI End Clear Flag */
#define I3C_CEVR_CCRF_Pos                   (17UL)
#define I3C_CEVR_CCRF_Msk                   (0x1UL << I3C_CEVR_CCRF_Pos)            /*!< 0x00020000 */
#define I3C_CEVR_CCRF                       I3C_CEVR_CCRF_Msk                       /*!< Controller-role Clear Flag */
#define I3C_CEVR_CCRUPDF_Pos                (18UL)
#define I3C_CEVR_CCRUPDF_Msk                (0x1UL << I3C_CEVR_CCRUPDF_Pos)         /*!< 0x00040000 */
#define I3C_CEVR_CCRUPDF                    I3C_CEVR_CCRUPDF_Msk                    /*!< Controller-role Update Clear Flag */
#define I3C_CEVR_CHJF_Pos                   (19UL)
#define I3C_CEVR_CHJF_Msk                   (0x1UL << I3C_CEVR_CHJF_Pos)            /*!< 0x00080000 */
#define I3C_CEVR_CHJF                       I3C_CEVR_CHJF_Msk                       /*!< Hot Join Clear Flag */
#define I3C_CEVR_CWKPF_Pos                  (21UL)
#define I3C_CEVR_CWKPF_Msk                  (0x1UL << I3C_CEVR_CWKPF_Pos)           /*!< 0x00200000 */
#define I3C_CEVR_CWKPF                      I3C_CEVR_CWKPF_Msk                      /*!< Wake Up Clear Flag */
#define I3C_CEVR_CGETF_Pos                  (22UL)
#define I3C_CEVR_CGETF_Msk                  (0x1UL << I3C_CEVR_CGETF_Pos)           /*!< 0x00400000 */
#define I3C_CEVR_CGETF                      I3C_CEVR_CGETF_Msk                      /*!< Get type CCC received Clear Flag */
#define I3C_CEVR_CSTAF_Pos                  (23UL)
#define I3C_CEVR_CSTAF_Msk                  (0x1UL << I3C_CEVR_CSTAF_Pos)           /*!< 0x00800000 */
#define I3C_CEVR_CSTAF                      I3C_CEVR_CSTAF_Msk                      /*!< Get Status Clear Flag */
#define I3C_CEVR_CDAUPDF_Pos                (24UL)
#define I3C_CEVR_CDAUPDF_Msk                (0x1UL << I3C_CEVR_CDAUPDF_Pos)         /*!< 0x01000000 */
#define I3C_CEVR_CDAUPDF                    I3C_CEVR_CDAUPDF_Msk                    /*!< Dynamic Address Update Clear Flag */
#define I3C_CEVR_CMWLUPDF_Pos               (25UL)
#define I3C_CEVR_CMWLUPDF_Msk               (0x1UL << I3C_CEVR_CMWLUPDF_Pos)        /*!< 0x02000000 */
#define I3C_CEVR_CMWLUPDF                   I3C_CEVR_CMWLUPDF_Msk                   /*!< Max Write Length Update Clear Flag */
#define I3C_CEVR_CMRLUPDF_Pos               (26UL)
#define I3C_CEVR_CMRLUPDF_Msk               (0x1UL << I3C_CEVR_CMRLUPDF_Pos)        /*!< 0x04000000 */
#define I3C_CEVR_CMRLUPDF                   I3C_CEVR_CMRLUPDF_Msk                   /*!< Max Read Length Update Clear Flag */
#define I3C_CEVR_CRSTF_Pos                  (27UL)
#define I3C_CEVR_CRSTF_Msk                  (0x1UL << I3C_CEVR_CRSTF_Pos)           /*!< 0x08000000 */
#define I3C_CEVR_CRSTF                      I3C_CEVR_CRSTF_Msk                      /*!< Reset Flag, due to Reset pattern received */
#define I3C_CEVR_CASUPDF_Pos                (28UL)
#define I3C_CEVR_CASUPDF_Msk                (0x1UL << I3C_CEVR_CASUPDF_Pos)         /*!< 0x10000000 */
#define I3C_CEVR_CASUPDF                    I3C_CEVR_CASUPDF_Msk                    /*!< Activity State Clear Flag */
#define I3C_CEVR_CINTUPDF_Pos               (29UL)
#define I3C_CEVR_CINTUPDF_Msk               (0x1UL << I3C_CEVR_CINTUPDF_Pos)        /*!< 0x20000000 */
#define I3C_CEVR_CINTUPDF                   I3C_CEVR_CINTUPDF_Msk                   /*!< Interrupt Update Clear Flag */
#define I3C_CEVR_CDEFF_Pos                  (30UL)
#define I3C_CEVR_CDEFF_Msk                  (0x1UL << I3C_CEVR_CDEFF_Pos)           /*!< 0x40000000 */
#define I3C_CEVR_CDEFF                      I3C_CEVR_CDEFF_Msk                      /*!< List of Targets Command Received Clear Flag */
#define I3C_CEVR_CGRPF_Pos                  (31UL)
#define I3C_CEVR_CGRPF_Msk                  (0x1UL << I3C_CEVR_CGRPF_Pos)           /*!< 0x80000000 */
#define I3C_CEVR_CGRPF                      I3C_CEVR_CGRPF_Msk                      /*!< List of Group Addresses Command Received Clear Flag */

/*******************  Bit definition for I3C_MISR register  *******************/
#define I3C_MISR_CFNFMIS_Pos                (2UL)
#define I3C_MISR_CFNFMIS_Msk                (0x1UL << I3C_MISR_CFNFMIS_Pos)         /*!< 0x00000004 */
#define I3C_MISR_CFNFMIS                    I3C_MISR_CFNFMIS_Msk                    /*!< Control FIFO Not Full Mask Interrupt Status */
#define I3C_MISR_SFNEMIS_Pos                (3UL)
#define I3C_MISR_SFNEMIS_Msk                (0x1UL << I3C_MISR_SFNEMIS_Pos)         /*!< 0x00000008 */
#define I3C_MISR_SFNEMIS                    I3C_MISR_SFNEMIS_Msk                    /*!< Status FIFO Not Empty Mask Interrupt Status */
#define I3C_MISR_TXFNFMIS_Pos               (4UL)
#define I3C_MISR_TXFNFMIS_Msk               (0x1UL << I3C_MISR_TXFNFMIS_Pos)        /*!< 0x00000010 */
#define I3C_MISR_TXFNFMIS                   I3C_MISR_TXFNFMIS_Msk                   /*!< TX FIFO Not Full Mask Interrupt Status */
#define I3C_MISR_RXFNEMIS_Pos               (5UL)
#define I3C_MISR_RXFNEMIS_Msk               (0x1UL << I3C_MISR_RXFNEMIS_Pos)        /*!< 0x00000020 */
#define I3C_MISR_RXFNEMIS                   I3C_MISR_RXFNEMIS_Msk                   /*!< RX FIFO Not Empty Mask Interrupt Status */
#define I3C_MISR_FCMIS_Pos                  (9UL)
#define I3C_MISR_FCMIS_Msk                  (0x1UL << I3C_MISR_FCMIS_Pos)           /*!< 0x00000200 */
#define I3C_MISR_FCMIS                      I3C_MISR_FCMIS_Msk                      /*!< Frame Complete Mask Interrupt Status */
#define I3C_MISR_RXTGTENDMIS_Pos            (10UL)
#define I3C_MISR_RXTGTENDMIS_Msk            (0x1UL << I3C_MISR_RXTGTENDMIS_Pos)     /*!< 0x00000400 */
#define I3C_MISR_RXTGTENDMIS                I3C_MISR_RXTGTENDMIS_Msk                /*!< Reception Target End Mask Interrupt Status */
#define I3C_MISR_ERRMIS_Pos                 (11UL)
#define I3C_MISR_ERRMIS_Msk                 (0x1UL << I3C_MISR_ERRMIS_Pos)          /*!< 0x00000800 */
#define I3C_MISR_ERRMIS                     I3C_MISR_ERRMIS_Msk                     /*!< Error Mask Interrupt Status */
#define I3C_MISR_IBIMIS_Pos                 (15UL)
#define I3C_MISR_IBIMIS_Msk                 (0x1UL << I3C_MISR_IBIMIS_Pos)          /*!< 0x00008000 */
#define I3C_MISR_IBIMIS                     I3C_MISR_IBIMIS_Msk                     /*!< IBI Mask Interrupt Status */
#define I3C_MISR_IBIENDMIS_Pos              (16UL)
#define I3C_MISR_IBIENDMIS_Msk              (0x1UL << I3C_MISR_IBIENDMIS_Pos)       /*!< 0x00010000 */
#define I3C_MISR_IBIENDMIS                  I3C_MISR_IBIENDMIS_Msk                  /*!< IBI End Mask Interrupt Status */
#define I3C_MISR_CRMIS_Pos                  (17UL)
#define I3C_MISR_CRMIS_Msk                  (0x1UL << I3C_MISR_CRMIS_Pos)           /*!< 0x00020000 */
#define I3C_MISR_CRMIS                      I3C_MISR_CRMIS_Msk                      /*!< Controller-role Mask Interrupt Status */
#define I3C_MISR_CRUPDMIS_Pos               (18UL)
#define I3C_MISR_CRUPDMIS_Msk               (0x1UL << I3C_MISR_CRUPDMIS_Pos)        /*!< 0x00040000 */
#define I3C_MISR_CRUPDMIS                   I3C_MISR_CRUPDMIS_Msk                   /*!< Controller-role Update Mask Interrupt Status */
#define I3C_MISR_HJMIS_Pos                  (19UL)
#define I3C_MISR_HJMIS_Msk                  (0x1UL << I3C_MISR_HJMIS_Pos)           /*!< 0x00080000 */
#define I3C_MISR_HJMIS                      I3C_MISR_HJMIS_Msk                      /*!< Hot Join Mask Interrupt Status */
#define I3C_MISR_WKPMIS_Pos                 (21UL)
#define I3C_MISR_WKPMIS_Msk                 (0x1UL << I3C_MISR_WKPMIS_Pos)          /*!< 0x00200000 */
#define I3C_MISR_WKPMIS                     I3C_MISR_WKPMIS_Msk                     /*!< Wake Up Mask Interrupt Status */
#define I3C_MISR_GETMIS_Pos                 (22UL)
#define I3C_MISR_GETMIS_Msk                 (0x1UL << I3C_MISR_GETMIS_Pos)          /*!< 0x00400000 */
#define I3C_MISR_GETMIS                     I3C_MISR_GETMIS_Msk                     /*!< Get type CCC received Mask Interrupt Status */
#define I3C_MISR_STAMIS_Pos                 (23UL)
#define I3C_MISR_STAMIS_Msk                 (0x1UL << I3C_MISR_STAMIS_Pos)          /*!< 0x00800000 */
#define I3C_MISR_STAMIS                     I3C_MISR_STAMIS_Msk                     /*!< Get Status Mask Interrupt Status */
#define I3C_MISR_DAUPDMIS_Pos               (24UL)
#define I3C_MISR_DAUPDMIS_Msk               (0x1UL << I3C_MISR_DAUPDMIS_Pos)        /*!< 0x01000000 */
#define I3C_MISR_DAUPDMIS                   I3C_MISR_DAUPDMIS_Msk                   /*!< Dynamic Address Update Mask Interrupt Status */
#define I3C_MISR_MWLUPDMIS_Pos              (25UL)
#define I3C_MISR_MWLUPDMIS_Msk              (0x1UL << I3C_MISR_MWLUPDMIS_Pos)       /*!< 0x02000000 */
#define I3C_MISR_MWLUPDMIS                  I3C_MISR_MWLUPDMIS_Msk                  /*!< Max Write Length Update Mask Interrupt Status */
#define I3C_MISR_MRLUPDMIS_Pos              (26UL)
#define I3C_MISR_MRLUPDMIS_Msk              (0x1UL << I3C_MISR_MRLUPDMIS_Pos)       /*!< 0x04000000 */
#define I3C_MISR_MRLUPDMIS                  I3C_MISR_MRLUPDMIS_Msk                  /*!< Max Read Length Update Mask Interrupt Status */
#define I3C_MISR_RSTMIS_Pos                 (27UL)
#define I3C_MISR_RSTMIS_Msk                 (0x1UL << I3C_MISR_RSTMIS_Pos)          /*!< 0x08000000 */
#define I3C_MISR_RSTMIS                     I3C_MISR_RSTMIS_Msk                     /*!< Reset Mask Interrupt Status, due to Reset pattern received */
#define I3C_MISR_ASUPDMIS_Pos               (28UL)
#define I3C_MISR_ASUPDMIS_Msk               (0x1UL << I3C_MISR_ASUPDMIS_Pos)        /*!< 0x10000000 */
#define I3C_MISR_ASUPDMIS                   I3C_MISR_ASUPDMIS_Msk                   /*!< Activity State Mask Interrupt Status */
#define I3C_MISR_INTUPDMIS_Pos              (29UL)
#define I3C_MISR_INTUPDMIS_Msk              (0x1UL << I3C_MISR_INTUPDMIS_Pos)       /*!< 0x20000000 */
#define I3C_MISR_INTUPDMIS                  I3C_MISR_INTUPDMIS_Msk                  /*!< Interrupt Update Mask Interrupt Status */
#define I3C_MISR_DEFMIS_Pos                 (30UL)
#define I3C_MISR_DEFMIS_Msk                 (0x1UL << I3C_MISR_DEFMIS_Pos)          /*!< 0x40000000 */
#define I3C_MISR_DEFMIS                     I3C_MISR_DEFMIS_Msk                     /*!< List of Targets Command Received Mask Interrupt Status */
#define I3C_MISR_GRPMIS_Pos                 (31UL)
#define I3C_MISR_GRPMIS_Msk                 (0x1UL << I3C_MISR_GRPMIS_Pos)          /*!< 0x80000000 */
#define I3C_MISR_GRPMIS                     I3C_MISR_GRPMIS_Msk                     /*!< List of Group Addresses Command Received Mask Interrupt Status */

/******************  Bit definition for I3C_DEVR0 register  *******************/
#define I3C_DEVR0_DAVAL_Pos                 (0UL)
#define I3C_DEVR0_DAVAL_Msk                 (0x1UL << I3C_DEVR0_DAVAL_Pos)          /*!< 0x00000001 */
#define I3C_DEVR0_DAVAL                     I3C_DEVR0_DAVAL_Msk                     /*!< Dynamic Address Validity */
#define I3C_DEVR0_DA_Pos                    (1UL)
#define I3C_DEVR0_DA_Msk                    (0x7FUL << I3C_DEVR0_DA_Pos)            /*!< 0x000000FE */
#define I3C_DEVR0_DA                        I3C_DEVR0_DA_Msk                        /*!< Own Target Device Address */
#define I3C_DEVR0_IBIEN_Pos                 (16UL)
#define I3C_DEVR0_IBIEN_Msk                 (0x1UL << I3C_DEVR0_IBIEN_Pos)          /*!< 0x00010000 */
#define I3C_DEVR0_IBIEN                     I3C_DEVR0_IBIEN_Msk                     /*!< IBI Enable */
#define I3C_DEVR0_CREN_Pos                  (17UL)
#define I3C_DEVR0_CREN_Msk                  (0x1UL << I3C_DEVR0_CREN_Pos)           /*!< 0x00020000 */
#define I3C_DEVR0_CREN                      I3C_DEVR0_CREN_Msk                      /*!< Controller-role Enable */
#define I3C_DEVR0_HJEN_Pos                  (19UL)
#define I3C_DEVR0_HJEN_Msk                  (0x1UL << I3C_DEVR0_HJEN_Pos)           /*!< 0x00080000 */
#define I3C_DEVR0_HJEN                      I3C_DEVR0_HJEN_Msk                      /*!< Hot Join Enable */
#define I3C_DEVR0_AS_Pos                    (20UL)
#define I3C_DEVR0_AS_Msk                    (0x3UL << I3C_DEVR0_AS_Pos)             /*!< 0x00300000 */
#define I3C_DEVR0_AS                        I3C_DEVR0_AS_Msk                        /*!< Activity State value update after ENTAx received */
#define I3C_DEVR0_AS_0                      (0x1UL << I3C_DEVR0_AS_Pos)             /*!< 0x00100000 */
#define I3C_DEVR0_AS_1                      (0x2UL << I3C_DEVR0_AS_Pos)             /*!< 0x00200000 */
#define I3C_DEVR0_RSTACT_Pos                (22UL)
#define I3C_DEVR0_RSTACT_Msk                (0x3UL << I3C_DEVR0_RSTACT_Pos)         /*!< 0x00C000000 */
#define I3C_DEVR0_RSTACT                    I3C_DEVR0_RSTACT_Msk                    /*!< Reset Action value update after RSTACT received */
#define I3C_DEVR0_RSTACT_0                  (0x1UL << I3C_DEVR0_RSTACT_Pos)         /*!< 0x00400000 */
#define I3C_DEVR0_RSTACT_1                  (0x2UL << I3C_DEVR0_RSTACT_Pos)         /*!< 0x00800000 */
#define I3C_DEVR0_RSTVAL_Pos                (24UL)
#define I3C_DEVR0_RSTVAL_Msk                (0x1UL << I3C_DEVR0_RSTVAL_Pos)         /*!< 0x01000000 */
#define I3C_DEVR0_RSTVAL                    I3C_DEVR0_RSTVAL_Msk                    /*!< Reset Action Valid */

