zephyrproject-rtos/hal_stm32/stm32cube/stm32u3xx/soc/stm32u345xx.h
/********************  Bit definition for RCC_APB3RSTR register  **************/
#define RCC_APB3RSTR_SYSCFGRST_Pos          (1UL)
#define RCC_APB3RSTR_SYSCFGRST_Msk          (0x1UL << RCC_APB3RSTR_SYSCFGRST_Pos)     /*!< 0x00000002 */
#define RCC_APB3RSTR_SYSCFGRST              RCC_APB3RSTR_SYSCFGRST_Msk                /*!< SYSCFG Reset */
#define RCC_APB3RSTR_LPUART1RST_Pos         (6UL)
#define RCC_APB3RSTR_LPUART1RST_Msk         (0x1UL << RCC_APB3RSTR_LPUART1RST_Pos)    /*!< 0x00000040 */
#define RCC_APB3RSTR_LPUART1RST             RCC_APB3RSTR_LPUART1RST_Msk               /*!< LPUART1 Reset */
#define RCC_APB3RSTR_I2C3RST_Pos            (7UL)
#define RCC_APB3RSTR_I2C3RST_Msk            (0x1UL << RCC_APB3RSTR_I2C3RST_Pos)       /*!< 0x00000080 */
#define RCC_APB3RSTR_I2C3RST                RCC_APB3RSTR_I2C3RST_Msk                  /*!< I2C3 Reset */
#define RCC_APB3RSTR_LPTIM1RST_Pos          (11UL)
#define RCC_APB3RSTR_LPTIM1RST_Msk          (0x1UL << RCC_APB3RSTR_LPTIM1RST_Pos)     /*!< 0x00000800 */
#define RCC_APB3RSTR_LPTIM1RST              RCC_APB3RSTR_LPTIM1RST_Msk                /*!< LPTIM1 Reset */
#define RCC_APB3RSTR_LPTIM3RST_Pos          (12UL)
#define RCC_APB3RSTR_LPTIM3RST_Msk          (0x1UL << RCC_APB3RSTR_LPTIM3RST_Pos)     /*!< 0x00001000 */
#define RCC_APB3RSTR_LPTIM3RST              RCC_APB3RSTR_LPTIM3RST_Msk                /*!< LPTIM3 Reset */
#define RCC_APB3RSTR_LPTIM4RST_Pos          (13UL)
#define RCC_APB3RSTR_LPTIM4RST_Msk          (0x1UL << RCC_APB3RSTR_LPTIM4RST_Pos)     /*!< 0x00002000 */
#define RCC_APB3RSTR_LPTIM4RST              RCC_APB3RSTR_LPTIM4RST_Msk                /*!< LPTIM4 Reset */
#define RCC_APB3RSTR_COMPRST_Pos            (15UL)
#define RCC_APB3RSTR_COMPRST_Msk            (0x1UL << RCC_APB3RSTR_COMPRST_Pos)       /*!< 0x00008000 */
#define RCC_APB3RSTR_COMPRST                RCC_APB3RSTR_COMPRST_Msk                  /*!< COMP Reset */

/********************  Bit definition for RCC_AHB1ENR register  **************/
#define RCC_AHB1ENR1_GPDMA1EN_Pos           (0UL)
#define RCC_AHB1ENR1_GPDMA1EN_Msk           (0x1UL << RCC_AHB1ENR1_GPDMA1EN_Pos)      /*!< 0x00000001 */
#define RCC_AHB1ENR1_GPDMA1EN               RCC_AHB1ENR1_GPDMA1EN_Msk                 /*!< GPDMA1 Enable */
#define RCC_AHB1ENR1_ADF1EN_Pos             (3UL)
#define RCC_AHB1ENR1_ADF1EN_Msk             (0x1UL << RCC_AHB1ENR1_ADF1EN_Pos)        /*!< 0x00000008 */
#define RCC_AHB1ENR1_ADF1EN                 RCC_AHB1ENR1_ADF1EN_Msk                   /*!< ADF1 Enable */
#define RCC_AHB1ENR1_FLASHEN_Pos            (8UL)
#define RCC_AHB1ENR1_FLASHEN_Msk            (0x1UL << RCC_AHB1ENR1_FLASHEN_Pos)       /*!< 0x00000100 */
#define RCC_AHB1ENR1_FLASHEN                RCC_AHB1ENR1_FLASHEN_Msk                  /*!< FLASH Enable */
#define RCC_AHB1ENR1_CRCEN_Pos              (12UL)
#define RCC_AHB1ENR1_CRCEN_Msk              (0x1UL << RCC_AHB1ENR1_CRCEN_Pos)         /*!< 0x00001000 */
#define RCC_AHB1ENR1_CRCEN                  RCC_AHB1ENR1_CRCEN_Msk                    /*!< CRC Enable */
#define RCC_AHB1ENR1_TSCEN_Pos              (16UL)
#define RCC_AHB1ENR1_TSCEN_Msk              (0x1UL << RCC_AHB1ENR1_TSCEN_Pos)         /*!< 0x00010000 */
#define RCC_AHB1ENR1_TSCEN                  RCC_AHB1ENR1_TSCEN_Msk                    /*!< TSC Enable */
#define RCC_AHB1ENR1_RAMCFGEN_Pos           (17UL)
#define RCC_AHB1ENR1_RAMCFGEN_Msk           (0x1UL << RCC_AHB1ENR1_RAMCFGEN_Pos)      /*!< 0x00020000 */
#define RCC_AHB1ENR1_RAMCFGEN               RCC_AHB1ENR1_RAMCFGEN_Msk                 /*!< RAMCFG Enable */
#define RCC_AHB1ENR1_GTZC1EN_Pos            (24UL)
#define RCC_AHB1ENR1_GTZC1EN_Msk            (0x1UL << RCC_AHB1ENR1_GTZC1EN_Pos)       /*!< 0x01000000 */
#define RCC_AHB1ENR1_GTZC1EN                RCC_AHB1ENR1_GTZC1EN_Msk                  /*!< GTZC1 Enable */
#define RCC_AHB1ENR1_SRAM1EN_Pos            (31UL)
#define RCC_AHB1ENR1_SRAM1EN_Msk            (0x1UL << RCC_AHB1ENR1_SRAM1EN_Pos)       /*!< 0x80000000 */
#define RCC_AHB1ENR1_SRAM1EN                RCC_AHB1ENR1_SRAM1EN_Msk                  /*!< SRAM1 Enable */

/********************  Bit definition for RCC_AHB2ENR1 register  **************/
#define RCC_AHB2ENR1_GPIOAEN_Pos            (0UL)
#define RCC_AHB2ENR1_GPIOAEN_Msk            (0x1UL << RCC_AHB2ENR1_GPIOAEN_Pos)       /*!< 0x00000001 */
#define RCC_AHB2ENR1_GPIOAEN                RCC_AHB2ENR1_GPIOAEN_Msk                  /*!< IO port A Enable */
#define RCC_AHB2ENR1_GPIOBEN_Pos            (1UL)
#define RCC_AHB2ENR1_GPIOBEN_Msk            (0x1UL << RCC_AHB2ENR1_GPIOBEN_Pos)       /*!< 0x00000002 */
#define RCC_AHB2ENR1_GPIOBEN                RCC_AHB2ENR1_GPIOBEN_Msk                  /*!< IO port B Enable */
#define RCC_AHB2ENR1_GPIOCEN_Pos            (2UL)
#define RCC_AHB2ENR1_GPIOCEN_Msk            (0x1UL << RCC_AHB2ENR1_GPIOCEN_Pos)       /*!< 0x00000004 */
#define RCC_AHB2ENR1_GPIOCEN                RCC_AHB2ENR1_GPIOCEN_Msk                  /*!< IO port C Enable */
#define RCC_AHB2ENR1_GPIODEN_Pos            (3UL)
#define RCC_AHB2ENR1_GPIODEN_Msk            (0x1UL << RCC_AHB2ENR1_GPIODEN_Pos)       /*!< 0x00000008 */
#define RCC_AHB2ENR1_GPIODEN                RCC_AHB2ENR1_GPIODEN_Msk                  /*!< IO port D Enable */
#define RCC_AHB2ENR1_GPIOHEN_Pos            (7UL)
#define RCC_AHB2ENR1_GPIOHEN_Msk            (0x1UL << RCC_AHB2ENR1_GPIOHEN_Pos)       /*!< 0x00000080 */
#define RCC_AHB2ENR1_GPIOHEN                RCC_AHB2ENR1_GPIOHEN_Msk                  /*!< IO port H Enable */
#define RCC_AHB2ENR1_ADC12EN_Pos            (10UL)
#define RCC_AHB2ENR1_ADC12EN_Msk            (0x1UL << RCC_AHB2ENR1_ADC12EN_Pos)       /*!< 0x00000400 */
#define RCC_AHB2ENR1_ADC12EN                RCC_AHB2ENR1_ADC12EN_Msk                  /*!< ADC12 Enable */
#define RCC_AHB2ENR1_DAC1EN_Pos             (11UL)
#define RCC_AHB2ENR1_DAC1EN_Msk             (0x1UL << RCC_AHB2ENR1_DAC1EN_Pos)        /*!< 0x00000800 */
#define RCC_AHB2ENR1_DAC1EN                 RCC_AHB2ENR1_DAC1EN_Msk                   /*!< DAC1 Enable */
#define RCC_AHB2ENR1_AESEN_Pos              (16UL)
#define RCC_AHB2ENR1_AESEN_Msk              (0x1UL << RCC_AHB2ENR1_AESEN_Pos)         /*!< 0x00010000 */
#define RCC_AHB2ENR1_AESEN                  RCC_AHB2ENR1_AESEN_Msk                    /*!< AES Enable */
#define RCC_AHB2ENR1_HASHEN_Pos             (17UL)
#define RCC_AHB2ENR1_HASHEN_Msk             (0x1UL << RCC_AHB2ENR1_HASHEN_Pos)        /*!< 0x00020000 */
#define RCC_AHB2ENR1_HASHEN                 RCC_AHB2ENR1_HASHEN_Msk                   /*!< HASH Enable */
#define RCC_AHB2ENR1_RNGEN_Pos              (18UL)
#define RCC_AHB2ENR1_RNGEN_Msk              (0x1UL << RCC_AHB2ENR1_RNGEN_Pos)         /*!< 0x00040000 */
#define RCC_AHB2ENR1_RNGEN                  RCC_AHB2ENR1_RNGEN_Msk                    /*!< RNG Enable */
#define RCC_AHB2ENR1_SRAM2EN_Pos            (30UL)
#define RCC_AHB2ENR1_SRAM2EN_Msk            (0x1UL << RCC_AHB2ENR1_SRAM2EN_Pos)       /*!< 0x40000000 */
#define RCC_AHB2ENR1_SRAM2EN                RCC_AHB2ENR1_SRAM2EN_Msk                  /*!< SRAM2 Enable */

/********************  Bit definition for RCC_AHB2ENR2 register  **************/
#define RCC_AHB2ENR2_OCTOSPI1EN_Pos         (4UL)
#define RCC_AHB2ENR2_OCTOSPI1EN_Msk         (0x1UL << RCC_AHB2ENR2_OCTOSPI1EN_Pos)    /*!< 0x00000010 */
#define RCC_AHB2ENR2_OCTOSPI1EN             RCC_AHB2ENR2_OCTOSPI1EN_Msk               /*!< OCTOSPI1 Enable */

